In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

In [9]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [52]:
from sqlalchemy import text

def get_rental_info(engine,month,year):
    with engine.connect() as connection:
        query = text("""SELECT * FROM rental
                                WHERE MONTH(rental_date) = :month AND YEAR(rental_date) = :year;
                    """)
        result = connection.execute(query, {
            "month": month,
            "year": year
        })
        df = pd.DataFrame(result.all())
    return df
df = get_rental_info(engine,5,2005)

In [53]:
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53
...,...,...,...,...,...,...,...
1151,1153,2005-05-31 21:36:44,2725,506,2005-06-10 01:26:44,2,2006-02-15 21:30:53
1152,1154,2005-05-31 21:42:09,2732,59,2005-06-08 16:40:09,1,2006-02-15 21:30:53
1153,1155,2005-05-31 22:17:11,2048,251,2005-06-04 20:27:11,2,2006-02-15 21:30:53
1154,1156,2005-05-31 22:37:34,460,106,2005-06-01 23:02:34,2,2006-02-15 21:30:53
1155,1157,2005-05-31 22:47:45,1449,61,2005-06-02 18:01:45,1,2006-02-15 21:30:53

In [54]:


def get_rental_info_customer_id(engine,month,year):
    with engine.connect() as connection:
        query = text("""SELECT * FROM rental
                                WHERE MONTH(rental_date) = :month AND YEAR(rental_date) = :year;
                    """)
        result = connection.execute(query, {
            "month": month,
            "year": year
        })
        df = pd.DataFrame(result.all())

    column_name = "rentals_" + f"{int(month):02d}" + "_" + str(year)

    df =df.groupby("customer_id").size().reset_index(name=column_name)
    return df
df = get_rental_info_customer_id(engine,5,2005)

In [55]:
df

     customer_id  rentals_05_2005
0              1                2
1              2                1
2              3                2
3              5                3
4              6                3
..           ...              ...
515          594                4
516          595                1
517          596                6
518          597                2
519          599                1

[520 rows x 2 columns]

In [56]:
def compare_rental_info(engine,month1,year1,month2,year2):
    df1 = get_rental_info_customer_id(engine,month1,year1)
    df2 = get_rental_info_customer_id(engine,month2,year2)

    merged_df = pd.merge(df1, df2, on='customer_id', how='outer').fillna(0)

    merged_df['difference'] = merged_df.iloc[:, 1] - merged_df.iloc[:, 2]

    return merged_df
comparison_df = compare_rental_info(engine,5,2005,6,2005)
comparison_df

     customer_id  rentals_05_2005  rentals_06_2005  difference
0              1              2.0              7.0        -5.0
1              2              1.0              1.0         0.0
2              3              2.0              4.0        -2.0
3              4              0.0              6.0        -6.0
4              5              3.0              5.0        -2.0
..           ...              ...              ...         ...
593          595              1.0              2.0        -1.0
594          596              6.0              2.0         4.0
595          597              2.0              3.0        -1.0
596          598              0.0              1.0        -1.0
597          599              1.0              4.0        -3.0

[598 rows x 4 columns]